Revit 2027 API
ScheduleHeightsOnSheet.GetBodyRowHeights Method
 Returns each row's height of schedule body on sheet view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetBodyRowHeights()
Public Function GetBodyRowHeights As IList(Of Double)
public:
IList<double>^ GetBodyRowHeights()
member GetBodyRowHeights : unit -> IList<float>
Return Value
IList<Double>
 Each row's height of schedule body on sheet view.
See Also
Reference
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace